In [62]:
import pandas as pd
import numpy as np 
from scipy.stats import spearmanr
import matplotlib.pyplot as plt
import seaborn as sns
df=pd.read_csv("train.csv")
df2=pd.read_csv("train.csv")
df3=df2['RoomService']
dft=pd.read_csv("test.csv")
df.head()
df=df.drop("PassengerId",axis=1)
df.head()
df.dropna(subset=["HomePlanet","CryoSleep","Destination"],inplace=True)
df.info()
df.drop("Cabin",axis=1,inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8103 entries, 0 to 8692
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   HomePlanet    8103 non-null   object
 1   CryoSleep     8103 non-null   object
 2   Cabin         7920 non-null   object
 3   Destination   8103 non-null   object
 4   Age           7930 non-null   float64
 5   VIP           7913 non-null   object
 6   RoomService   7933 non-null   float64
 7   FoodCourt     7931 non-null   float64
 8   ShoppingMall  7915 non-null   float64
 9   Spa           7930 non-null   float64
 10  VRDeck        7925 non-null   float64
 11  Name          7924 non-null   object
 12  Transported   8103 non-null   bool
dtypes: bool(1), float64(6), object(6)
memory usage: 830.9+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 8103 entries, 0 to 8692
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   HomePlanet    8103 non-null   object
 1   CryoSleep     8103 non-null   object
 2   Destination   8103 non-null   object
 3   Age           7930 non-null   float64
 4   VIP           7913 non-null   object
 5   RoomService   7933 non-null   float64
 6   FoodCourt     7931 non-null   float64
 7   ShoppingMall  7915 non-null   float64
 8   Spa           7930 non-null   float64
 9   VRDeck        7925 non-null   float64
 10  Name          7924 non-null   object
 11  Transported   8103 non-null   bool
dtypes: bool(1), float64(6), object(5)
memory usage: 767.6+ KB

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8103 entries, 0 to 8692
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   HomePlanet    8103 non-null   object
 1   CryoSleep     8103 non-null   object
 2   Destination   8103 non-null   object
 3   Age           7930 non-null   float64
 4   VIP           7913 non-null   object
 5   RoomService   7933 non-null   float64
 6   FoodCourt     7931 non-null   float64
 7   ShoppingMall  7915 non-null   float64
 8   Spa           7930 non-null   float64
 9   VRDeck        7925 non-null   float64
 10  Name          7924 non-null   object
 11  Transported   8103 non-null   bool
dtypes: bool(1), float64(6), object(5)
memory usage: 767.6+ KB

In [64]:
df.describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
count,7930.000000,7933.000000,7931.000000,7915.000000,7930.000000,7925.000000
mean,28.823077,225.691668,465.534485,175.589893,312.912989,307.333628
std,14.515589,671.944468,1642.451492,614.068765,1138.148433,1159.971824
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,19.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,38.000000,47.000000,77.500000,28.000000,61.000000,46.000000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000

In [65]:
df["Age"].fillna(df["Age"].mean(),inplace=True)
df["Age"].median()

27.0

In [66]:
df["HomePlanet"].unique()

array(['Europa', 'Earth', 'Mars'], dtype=object)

In [67]:

df1=df[["HomePlanet","VIP"]]
matrix=df1.pivot_table(index="HomePlanet",columns="VIP",aggfunc="size",fill_value=0)
matrix

VIP         False  True
HomePlanet
Earth        4284      0
Europa       1870    126
Mars         1570     63

In [68]:
cond1=df['HomePlanet']=='Earth'
cond2=df['VIP'].isna()
df.loc[cond1 & cond2 , 'VIP']=False

In [69]:
cond1=df['HomePlanet']=='Mars'
cond2=df['VIP'].isna()
df.loc[(cond1)&(cond2),'VIP']=False

In [70]:
df.dropna(subset=['VIP'],inplace=True)

In [71]:
df['RoomService'].isna().sum()

170

In [72]:
roomservicemean=df['RoomService'].mean()
roomservicemode=df['RoomService'].mode()
roomservicemode

0    0.0
Name: RoomService, dtype: float64

In [73]:
cond1=df['VIP']==True
cond2=df['RoomService'].isna()
df.loc[(cond1)&(cond2),'RoomService']=roomservicemean
df.shape

(8061, 12)

In [74]:

df['RoomService'].shape

(8061,)

In [75]:
df['RoomService'].isna().sum()

166

In [76]:

df['RoomService'].shape
df['RoomService'].fillna(0,inplace=True)

In [77]:
df4=df.copy()
df = df.loc[:, ~df.columns.duplicated(keep='first')]

In [78]:
cond1=df['VIP']==True
cond2=df['FoodCourt'].isna()
df.loc[(cond1)&(cond2),'FoodCourt']=df['FoodCourt'].mean()

In [79]:
df['FoodCourt'].fillna(0,inplace=True)

In [80]:
(df['ShoppingMall']==0).sum()

5171

In [81]:
df['ShoppingMall'].fillna(0,inplace=True)

In [82]:
(df['Spa']==0).sum()
df['Spa'].fillna(0,inplace=True)
df.drop(['Name'],axis=1,inplace=True)

In [83]:
(df['VRDeck']==0).sum()
df['VRDeck'].fillna(0,inplace=True)

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8061 entries, 0 to 8692
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   HomePlanet    8061 non-null   object
 1   CryoSleep     8061 non-null   object
 2   Destination   8061 non-null   object
 3   Age           8061 non-null   float64
 4   VIP           8061 non-null   object
 5   RoomService   8061 non-null   float64
 6   FoodCourt     8061 non-null   float64
 7   ShoppingMall  8061 non-null   float64
 8   Spa           8061 non-null   float64
 9   VRDeck        8061 non-null   float64
 10  Transported   8061 non-null   bool
dtypes: bool(1), float64(6), object(4)
memory usage: 700.6+ KB

In [85]:
df.describe()

,Age,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck
count,8061.000000,8061.000000,8061.000000,8061.000000,8061.000000,8061.000000
mean,28.787172,220.385694,449.804705,172.282471,304.297358,297.167349
std,14.350389,660.302733,1607.724261,608.932894,1124.150516,1137.301944
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,20.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,37.000000,42.000000,61.000000,23.000000,53.000000,39.000000
max,79.000000,14327.000000,29813.000000,23492.000000,22408.000000,24133.000000

In [86]:
df.head()

,HomePlanet,CryoSleep,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Transported
0,Europa,False,TRAPPIST-1e,39.0,False,0.0,0.0,0.0,0.0,0.0,False
1,Earth,False,TRAPPIST-1e,24.0,False,109.0,9.0,25.0,549.0,44.0,True
2,Europa,False,TRAPPIST-1e,58.0,True,43.0,3576.0,0.0,6715.0,49.0,False
3,Europa,False,TRAPPIST-1e,33.0,False,0.0,1283.0,371.0,3329.0,193.0,False
4,Earth,False,TRAPPIST-1e,16.0,False,303.0,70.0,151.0,565.0,2.0,True

In [87]:
df['CryoSleep']= df['CryoSleep'].apply(lambda x: 1 if x==True else 0)

In [90]:
header=["VIP","Transported"]
df[header]=df[header].applymap(lambda x: 1 if x==True else 0)

In [92]:
df.head()

,HomePlanet,CryoSleep,Destination,Age,VIP,RoomService,FoodCourt,ShoppingMall,Spa,VRDeck,Transported
0,Europa,0,TRAPPIST-1e,39.0,0,0.0,0.0,0.0,0.0,0.0,0
1,Earth,0,TRAPPIST-1e,24.0,0,109.0,9.0,25.0,549.0,44.0,1
2,Europa,0,TRAPPIST-1e,58.0,1,43.0,3576.0,0.0,6715.0,49.0,0
3,Europa,0,TRAPPIST-1e,33.0,0,0.0,1283.0,371.0,3329.0,193.0,0
4,Earth,0,TRAPPIST-1e,16.0,0,303.0,70.0,151.0,565.0,2.0,1